errors = {"DBError": "Виникла помилка при отриманні даних. Спробуйте пізніше або зверніться до розробників.",
          "block_was_deleted": "Схоже на те, що Ви видалили блок, який був прив'язаний до цього чату. Створіть хоча б один блок та перезапустіть бота за допомогою команди /start.",
          "not_schedules": "Розкладу занять ще не має😥\nБудь ласка заповніть таблицу, після чого спробуйте ще раз.",
          "not_consultations": "Розкладу консультацій ще не має😥\nБудь ласка заповніть таблицу, після чого спробуйте ще раз.",
          "token_not_blocks": "Токен був знайдений в базі даних, але Ви ще не створили жодного блоку. Створіть хоча б один і введіть ще раз токен.",
          "not_token": "Токен не знайдений в базі даних. Введіть ще раз."}

welcome_text = ("Вітаю! 👋\n\n Я - бот, який допоможе Вам з розкладом занять і консультацій.\n\n"
                "Ось що я вмію:\n"
                "- /schedule покаже тобі розклад на поточний тиждень.\n"
                "- /nextschedule покаже тобі розклад на наступний тиждень.\n"
                "- /now покаже поточне заняття.\n"
                "- /next покаже наступне заняття.\n"
                "- /consultations покаже список доступних консультацій.\n")
