import { Metadata } from 'next'
import Link from 'next/link'

export const metadata: Metadata = {
	title: "Умови користування сайтом",
	description: "Retold - умови користування сайтом.",
	icons: {
		icon: "/icon.ico"
	},
	twitter: {
		card: "summary_large_image",
		title: "Умови користування сайтом",
		description: "Retold - умови користування сайтом.",
		images: ["https://retold.com.ua/og-small-logo.png"],
	},
	openGraph: {
		type: "website",
		url: "https://retold.com.ua/terms",
		title: "Умови користування сайтом",
		description: "Retold - умови користування сайтом.",
		siteName: "Retold",
		images: [
			{
				url: "https://retold.com.ua/opengraph-image.png",
				alt: "Retold OpenGraph Image",
			},
		],
	},
};

export default function TermsOfUse() {
	return (
		<div className="container max-w-7xl mx-auto px-4 py-10">
		<h1 className="text-2xl font-bold mb-4">Умови користування сайтом</h1>
		<h3 className='text-xl font-medium'>Вступ</h3>
		<p>Ласкаво просимо на наш сайт! Використовуючи наш сайт, ви погоджуєтеся дотримуватися таких умов користування. Якщо ви не згодні з цими умовами, будь ласка, не використовуйте наш сайт.</p>

		<h3 className='text-xl font-medium pt-4'>Визначення</h3>
		<ul>
			<li> - «Сайт» - веб-сайт, доступний за адресою retold.com.ua</li>
			<li> - «Користувач» - будь-яка особа, яка використовує цей сайт.</li>
			<li> - «Ми», “Наш” - власники та оператори цього сайту.</li>
		</ul>

		<h3 className='text-xl font-medium pt-4'>Використання сайту</h3>
		<p>Ви погоджуєтеся використовувати наш сайт виключно в законних цілях і не порушувати права третіх осіб. Забороняється використовувати наш сайт для поширення шкідливого програмного забезпечення, спаму, або будь-яких інших дій, які можуть завдати шкоди нашому сайту або іншим користувачам.</p>

		<h3 className='text-xl font-medium pt-4'>Реєстрація та акаунт</h3>
		<p>Під час реєстрації користувач повинен надати актуальну і точну інформацію. Ви несете відповідальність за збереження конфіденційності вашого облікового запису та пароля.</p>

		<h3 className='text-xl font-medium pt-4'>Конфіденційність</h3>
		<p>Ми зобов'язуємося захищати вашу конфіденційність. Будь ласка, ознайомтеся з нашою <Link className='text-retro-blue' href="/privacypolicy">Політикою конфіденційності</Link>, щоб дізнатися, як ми обробляємо ваші персональні дані.</p>

		<h3 className='text-xl font-medium pt-4'>Обмеження відповідальності</h3>
		<p>Ми не несемо відповідальності за будь-які збитки або шкоду, що виникли в результаті використання нашого сайту, включно з, але не обмежуючись, помилками, вірусами, збоями або перериваннями роботи сайту.</p>

		<h3 className='text-xl font-medium pt-4'>Посилання на сторонні сайти</h3>
		<p>Наш сайт може містити посилання на сторонні веб-сайти. Ми не несемо відповідальності за зміст і політику конфіденційності цих сайтів.</p>

		<h3 className='text-xl font-medium pt-4'>Зміни умов</h3>
		<p>Ми залишаємо за собою право вносити зміни до цих умов у будь-який час. Зміни набувають чинності з моменту їх публікації на сайті.</p>

		<h3 className='text-xl font-medium pt-4'>Контактна інформація</h3>
		<p>Якщо у вас виникли запитання з приводу цих умов, ви можете зв'язатися з нами за за допомогою телеграма: <Link className='text-retro-blue' href="https://t.me/mbsqd001">@mbsqd001</Link></p>
	  </div>
	)
}